applications/rust/integration/demo-build/benchmark.yaml
config:
  target: "http://127.0.0.1:80"
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 10
      name: Warm up
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: Burn
    - duration: 10
      arrivalRate: 100
      name: End

  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 6000
      - http.response_time.p95: 6000

scenarios:
  - name: "Navigate Menus"
    flow:
      - get:
          url: "/collection/FRONT_PAGE"
      - post:
          url: "/products/"
          json: "Shirt"
      - post:
          url: "/products/"
          json: "Keyboard"